app/Controllers/DashboardController.php

    public function getData(): ResponseInterface
    {
        // Hitung total kecamatan & desa
        $totalKecamatan = $this->db->table('kecamatan')->countAllResults();
        $totalDesa = $this->db->table('desa')->countAllResults();

        // --- Perhitungan Total Sekolah per Jenjang dengan JOIN ---
        // Bergabung dengan tabel jenjang_pendidikan untuk memfilter berdasarkan nama_jenjang
        $totalSMA = $this->db->table('sekolah s')
            ->join('jenjang_pendidikan jp', 's.id_jenjang = jp.id_jenjang')
            ->where('jp.nama_jenjang', 'SMA')->countAllResults();

        $totalSMK = $this->db->table('sekolah s')
            ->join('jenjang_pendidikan jp', 's.id_jenjang = jp.id_jenjang')
            ->where('jp.nama_jenjang', 'SMK')->countAllResults();

        $totalMA = $this->db->table('sekolah s')
            ->join('jenjang_pendidikan jp', 's.id_jenjang = jp.id_jenjang')
            ->where('jp.nama_jenjang', 'MA')->countAllResults();

        $totalSLB = $this->db->table('sekolah s')
            ->join('jenjang_pendidikan jp', 's.id_jenjang = jp.id_jenjang')
            ->where('jp.nama_jenjang', 'SLB')->countAllResults();

        // --- Perhitungan Total Sekolah per Status ---
        // Kolom 'status' ada di tabel sekolah, jadi tidak perlu join
        $totalNegeri = $this->db->table('sekolah')->where('status', 'Negeri')->countAllResults();
        $totalSwasta = $this->db->table('sekolah')->where('status', 'Swasta')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kecamatan`
SELECT COUNT(*) AS `numrows`
FROM `desa`
SELECT COUNT(*) AS `numrows`
FROM `sekolah` `s`
JOIN `jenjang_pendidikan` `jp` ON `s`.`id_jenjang` = `jp`.`id_jenjang`
WHERE `jp`.`nama_jenjang` = 'SMA'
SELECT COUNT(*) AS `numrows`
FROM `sekolah` `s`
JOIN `jenjang_pendidikan` `jp` ON `s`.`id_jenjang` = `jp`.`id_jenjang`
WHERE `jp`.`nama_jenjang` = 'SMK'
SELECT COUNT(*) AS `numrows`
FROM `sekolah` `s`
JOIN `jenjang_pendidikan` `jp` ON `s`.`id_jenjang` = `jp`.`id_jenjang`
WHERE `jp`.`nama_jenjang` = 'MA'
SELECT COUNT(*) AS `numrows`
FROM `sekolah` `s`
JOIN `jenjang_pendidikan` `jp` ON `s`.`id_jenjang` = `jp`.`id_jenjang`
WHERE `jp`.`nama_jenjang` = 'SLB'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `status` = 'Negeri'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `status` = 'Swasta'