app/Controllers/DesaController.php

SELECT COUNT(*) AS `numrows`
FROM `desa`
JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`id_kecamatan`
SELECT `desa`.`id_desa`, `desa`.`nama_desa`, `kecamatan`.`nama_kecamatan`
FROM `desa`
JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `desa`.`id_kecamatan`
ORDER BY `desa`.`id_desa` DESC
 LIMIT 10
---
    public function data(): ResponseInterface
    {
        $request = service('request');
        $draw    = intval($request->getVar('draw'));
        $start   = intval($request->getVar('start'));
        $length  = intval($request->getVar('length'));
        $search  = $request->getVar('search')['value'] ?? '';

        // Gunakan Query Builder untuk JOIN
        $builder = $this->db->table('desa');
        $builder->select('desa.id_desa, desa.nama_desa, kecamatan.nama_kecamatan');
        $builder->join('kecamatan', 'kecamatan.id_kecamatan = desa.id_kecamatan');

        // Hitung total data tanpa filter
        $totalData = $builder->countAllResults(false);

        // Tambahkan filter pencarian
        if (!empty($search)) {
            $builder->groupStart();
            $builder->like('desa.nama_desa', $search);
            $builder->orLike('kecamatan.nama_kecamatan', $search);
            $builder->groupEnd();
        }

        // Hitung total data dengan filter
        $totalFiltered = $builder->countAllResults(false);

        // Ambil data untuk halaman ini
        $builder->limit($length, $start);
        $builder->orderBy('desa.id_desa', 'DESC');
        $list = $builder->get()->getResultArray();