app/Controllers/JenjangPendidikanController.php

SELECT COUNT(*) AS `numrows` FROM `jenjang_pendidikan`
SELECT COUNT(*) AS `numrows`
FROM `jenjang_pendidikan`
SELECT *
FROM `jenjang_pendidikan`
ORDER BY `id_jenjang` DESC
 LIMIT 10
---
    public function data(): ResponseInterface
    {
        $request = service('request');
        $draw    = intval($request->getVar('draw'));
        $start   = intval($request->getVar('start'));
        $length  = intval($request->getVar('length'));
        $search  = $request->getVar('search')['value'] ?? '';

        $jenjangModel = $this->jenjang_pendidikan;

        $totalData = $jenjangModel->countAll();

        if (!empty($search)) {
            $jenjangModel = $jenjangModel->like('nama_jenjang', 'keterangan', $search);
        }

        $totalFiltered = $jenjangModel->countAllResults(false);

        $list = $jenjangModel
            ->orderBy('id_jenjang', 'DESC')
            ->findAll($length, $start);