app/Controllers/KecamatanController.php

    public function data(): ResponseInterface
    {
        $request = service('request');
        $draw    = intval($request->getVar('draw'));
        $start   = intval($request->getVar('start'));
        $length  = intval($request->getVar('length'));
        $search  = $request->getVar('search')['value'] ?? '';

        $kecamatanModel = $this->kecamatan;

        $totalData = $kecamatanModel->countAll();

        if (!empty($search)) {
            $kecamatanModel = $kecamatanModel->like('nama_kecamatan', $search);
        }

        $totalFiltered = $kecamatanModel->countAllResults(false);

        $list = $kecamatanModel
            ->orderBy('id_kecamatan', 'DESC')
            ->findAll($length, $start);
---
SELECT COUNT(*) AS `numrows` FROM `kecamatan`
SELECT COUNT(*) AS `numrows`
FROM `kecamatan`
SELECT *
FROM `kecamatan`
ORDER BY `id_kecamatan` DESC
 LIMIT 10