app/Controllers/SekolahController.php

    public function data(): ResponseInterface
    {
        $userRole = session('user_role');
        $operatorSekolahId = session('user_id_sekolah');

        $request = service('request');
        $draw    = intval($request->getVar('draw'));
        $start   = intval($request->getVar('start'));
        $length  = intval($request->getVar('length'));
        $search  = $request->getVar('search')['value'] ?? '';

        $builder = $this->db->table('sekolah');
        $builder->select('sekolah.*, jenjang_pendidikan.nama_jenjang, kecamatan.nama_kecamatan, desa.nama_desa');
        $builder->join('jenjang_pendidikan', 'jenjang_pendidikan.id_jenjang = sekolah.id_jenjang', 'left');
        $builder->join('kecamatan', 'kecamatan.id_kecamatan = sekolah.id_kecamatan', 'left');
        $builder->join('desa', 'desa.id_desa = sekolah.id_desa', 'left');

        if ($userRole === 'operator') {
            $builder->where('sekolah.id_sekolah', $operatorSekolahId);
        }

        $totalData = $builder->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
LEFT JOIN `jenjang_pendidikan` ON `jenjang_pendidikan`.`id_jenjang` = `sekolah`.`id_jenjang`
LEFT JOIN `kecamatan` ON `kecamatan`.`id_kecamatan` = `sekolah`.`id_kecamatan`
LEFT JOIN `desa` ON `desa`.`id_desa` = `sekolah`.`id_desa`